<template>
    <div class="protocol_mask" v-if="readProtocol">
        <div>
            <!--<div class="mask"></div>-->
            <!--<div class="protocol_box">-->
            <!--<div class="protocol_head">-->
            <!--<h3 class="logo"><img src="/static/img/logo/logo_block.png" alt=""></h3>-->
            <!--&lt;!&ndash;<span class="close" @click="protocolClose"><i class="el-icon-close"></i></span>&ndash;&gt;-->
            <!--</div>-->
            <!--<div class="protocol_body">-->
            <!--<p class="protocol_title">上传服务条款</p>-->
            <!--<div class="protocol_details">-->
            <!--<p class="protocol_txt">-->
            <!--一、服务条款的确认和接纳-->
            <!--为获得提供基于互联网的相关服务，服务使用人(以下称“用户”)必须同意本协议的全部条款并按照页面上的提示完成注册程序。如果用户在注册程序过程中点击“确认上传”按钮即表示用户与达成协议，完全接受本协议项下的全部条款。 除本服务协议外，您应同时阅读并接受“上传须知”及“版权保护指引”，该“上传须知””及“版权保护指引”为本协议之不可分割的一部分。-->

            <!--二、使用规则-->
            <!--1、用户应遵守以下法律及法规-->
            <!--用户同意遵守《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《信息网络传播权保护条例》等有关计算机及互联网规定的法律、法规、实施办法。在任何情况下，合理地认为用户的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向该用户提供服务，用户不得以此为理由追究的任何责任。-->

            <!--您承诺并保证：-->

            <!--(a) 您对上传至本平台的作品具有完全知识产权或经过合法授权；-->

            <!--(b) 如您上传至本平台的作品因知识产权引起任何纠纷，完全由您个人承担，平台不承担任何责任；-->

            <!--(c) 如本平台因您的行为导致被第三人追究责任，您有义务自行承担费用、采取一切措施维护本平台的合法权益，包括但不限于出庭作证、提交相关书面证词等；在平台被判决向第三人承担相应法律责任后，有权向您追偿。届时您不仅将承担平台向第三人承担的赔偿费用，还将承担平台因实现权利而产生的必要合理费用，包括但不限于诉讼费、公证费、调查费、律师费等。-->

            <!--2、禁止用户从事以下行为：-->

            <!--2.1 使用[小鸟壁纸 ]服务发送或传播敏感信息和违反国家法律制度的信息，包括但不限于下列信息:-->

            <!--(a) 反对宪法所确定的基本原则的；-->

            <!--(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；-->

            <!--(c) 损害国家荣誉和利益的；-->

            <!--(d) 煽动民族仇恨、民族歧视，破坏民族团结的；-->

            <!--(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；-->

            <!--(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；-->

            <!--(g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；-->

            <!--(h) 侮辱或者诽谤他人，侵害他人合法权益的；-->

            <!--(i) 含有法律、行政法规禁止的其他内容的。-->

            <!--2.2 使用[ 小鸟壁纸]提供的服务进行任何非法、淫秽、色情及其他违反公序良俗之活动，包括但不限于非法传销、诈骗、侵权、反动行为等。-->

            <!--2.3 对[小鸟壁纸 ]服务的任何部分或服务之使用或获得进行复制、拷贝、出售，或利用[小鸟壁纸]服务进行调查、广告或其他商业目的，但[小鸟壁纸 ]对特定服务另有适用指引或规定的除外。 在任何情况下，[小鸟壁纸 ]合理地认为用户的行为可能违反上述规定，[小鸟壁纸 ]可以在任何时候，不经事先通知终止向该用户提供服务。-->

            <!--三、 内容权利-->
            <!--用户上载的应用作品是指用户在本网站上载或发布的游戏或其它任何形式的内容包括文字、图片、音频、视频等。-->

            <!--除非[小鸟壁纸 ]收到相反通知，[小鸟壁纸 ]将用户视为其在本网站上载或发布的内容的版权拥有人。用户在本网站上载或发布内容即视为其同意授予[小鸟壁纸 ]所有上述内容的在全球范围内的不可撤销的、无限期的、可转让的非独家使用权，许可[小鸟壁纸]对前述内容进行任何形式的复制、修改、出版、发行及以其他方式使用或者授权第三方进行复制、修改、出版、发行及以其他方式使用。-->

            <!--[小鸟壁纸]有权将用户上传的壁纸以付费下载的形式对外提供，所得收益将由本平台和上传用户分成；对外付费下载的价格由本平台设定，并且本平台有权对定价进行调整，用户对此不持异议。-->

            <!--因用户进行上述内容在本网站的上载或发布，而导致任何第三方提出索赔要求或衍生的任何损害或损失，由用户承担全部责任。-->

            <!--如因用户上传至本平台的作品被第三方声称侵犯其任何权利的，本平台有权随时将相关作品删除而无经过上传用户的同意；同时，本平台有权追回该用户因上传该等作品而取得的任何收益，包括但不限于收费分成、虚拟币等。-->

            <!--内容权利详情请见：“上传须知”及“版权保护指引”。-->

            <!--四、隐私保护-->
            <!--保护用户隐私是[小鸟壁纸 ]的重点原则，[小鸟壁纸 ]保证不对外公开或向第三方提供用户注册资料及用户在使用服务时存储在[小鸟壁纸 ]的非公开内容，但下列情况除外：-->

            <!--1、事先获得用户的明确授权；-->

            <!--2、根据有关的法律法规要求；-->

            <!--3、按照相关政府主管部门及司法机关的要求；-->

            <!--4、为维护用户及社会公众的利益；-->

            <!--5、为维护[小鸟壁纸 ]的合法权益。-->

            <!--[小鸟壁纸 ]可能会与第三方合作向用户提供相关的服务，在此情况下，如该第三方同意承担与[小鸟壁纸 ]同等的保护用户隐私的责任，则[小鸟壁纸 ]可将用户的注册资料等提供给该第三方。 在不透露单个用户隐私资料的前提下，[小鸟壁纸 ]有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。-->

            <!--五、 免责声明-->
            <!--1、我们对于任何自本网站而获得的他人的信息、内容或者广告宣传等任何资讯（以下统称“信息”），不保证真实、准确和完整性。如果任何单位或者个人通过上述“信息”而进行任何行为，须自行甄别真伪和谨慎预防风险，否则，无论何种原因，我们不对任何非与我们直接发生的交易和/或行为承担任何直接、间接、附带或衍生的损失和责任。-->

            <!--2、我们不保证（包括但不限于）：-->

            <!--(a) 我们网站及内容适合您的使用要求；-->

            <!--(b) 我们网站及内容不受干扰，及时、安全、可靠或不出现错误；-->

            <!--(c) 您经由我们网站取得的任何产品、服务或其他材料符合您的期望。-->

            <!--3、您使用经由我们网站下载或取得的任何资料，其风险由您自行承担；因该等使用导致您电脑系统损坏或资料流失，您应自己负完全责任；-->

            <!--4、基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，我们不承担任何直接、间接的赔偿：-->

            <!--(a) 对我们网站及内容的使用或无法使用；-->

            <!--(b) 用户资料遭到未授权的使用或修改；-->

            <!--(c) 其他与我们相关的事宜。-->

            <!--六、修改协议-->
            <!--[小鸟壁纸 ]有权随时修改本协议的有关条款，一旦条款内容发生变动，[小鸟壁纸 ]将会在相关的页面提示修改内容。 用户如果不同意[小鸟壁纸 ]对服务条款所做的修改，可以放弃使用或访问本网站或取消已经获得的服务。如果用户继续使用服务，则视为用户接受服务条款的变动。-->

            <!--七、本协议解释权归[小鸟壁纸 ]所有。-->
            <!--</p>-->
            <!--</div>-->
            <!--</div>-->
            <!--<span class="time_btn" v-if="timer>0">{{timer}}s</span>-->
            <!--<el-button class="agreed" v-if="timer<=0" type="primary" @click="handleAgreed">我同意</el-button>-->
            <!--</div>-->
        </div>

        <el-dialog
            title="上传服务条款"
            :visible.sync="dialogVisible"
            :show-close="false"
            :close-on-press-escape="false"
            :close-on-click-modal="false"
            width="500px"
            center>
            <div class="protocol_body">
                <div class="protocol_details">
                    <p class="protocol_txt">
                        一、服务条款的确认和接纳
                        为获得提供基于互联网的相关服务，服务使用人(以下称“用户”)必须同意本协议的全部条款并按照页面上的提示完成注册程序。如果用户在注册程序过程中点击“确认上传”按钮即表示用户与达成协议，完全接受本协议项下的全部条款。 除本服务协议外，您应同时阅读并接受“上传须知”及“版权保护指引”，该“上传须知””及“版权保护指引”为本协议之不可分割的一部分。

                        二、使用规则
                        1、用户应遵守以下法律及法规
                        用户同意遵守《中华人民共和国著作权法》、《中华人民共和国计算机信息系统安全保护条例》、《计算机软件保护条例》、《互联网电子公告服务管理规定》、《信息网络传播权保护条例》等有关计算机及互联网规定的法律、法规、实施办法。在任何情况下，合理地认为用户的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向该用户提供服务，用户不得以此为理由追究的任何责任。

                        您承诺并保证：

                        (a) 您对上传至本平台的作品具有完全知识产权或经过合法授权；

                        (b) 如您上传至本平台的作品因知识产权引起任何纠纷，完全由您个人承担，平台不承担任何责任；

                        (c) 如本平台因您的行为导致被第三人追究责任，您有义务自行承担费用、采取一切措施维护本平台的合法权益，包括但不限于出庭作证、提交相关书面证词等；在平台被判决向第三人承担相应法律责任后，有权向您追偿。届时您不仅将承担平台向第三人承担的赔偿费用，还将承担平台因实现权利而产生的必要合理费用，包括但不限于诉讼费、公证费、调查费、律师费等。

                        2、禁止用户从事以下行为：

                        2.1 使用[小鸟壁纸 ]服务发送或传播敏感信息和违反国家法律制度的信息，包括但不限于下列信息:

                        (a) 反对宪法所确定的基本原则的；

                        (b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；

                        (c) 损害国家荣誉和利益的；

                        (d) 煽动民族仇恨、民族歧视，破坏民族团结的；

                        (e) 破坏国家宗教政策，宣扬邪教和封建迷信的；

                        (f) 散布谣言，扰乱社会秩序，破坏社会稳定的；

                        (g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；

                        (h) 侮辱或者诽谤他人，侵害他人合法权益的；

                        (i) 含有法律、行政法规禁止的其他内容的。

                        2.2 使用[ 小鸟壁纸]提供的服务进行任何非法、淫秽、色情及其他违反公序良俗之活动，包括但不限于非法传销、诈骗、侵权、反动行为等。

                        2.3 对[小鸟壁纸 ]服务的任何部分或服务之使用或获得进行复制、拷贝、出售，或利用[小鸟壁纸]服务进行调查、广告或其他商业目的，但[小鸟壁纸 ]对特定服务另有适用指引或规定的除外。 在任何情况下，[小鸟壁纸 ]合理地认为用户的行为可能违反上述规定，[小鸟壁纸 ]可以在任何时候，不经事先通知终止向该用户提供服务。

                        三、 内容权利
                        用户上载的应用作品是指用户在本网站上载或发布的游戏或其它任何形式的内容包括文字、图片、音频、视频等。

                        除非[小鸟壁纸 ]收到相反通知，[小鸟壁纸 ]将用户视为其在本网站上载或发布的内容的版权拥有人。用户在本网站上载或发布内容即视为其同意授予[小鸟壁纸 ]所有上述内容的在全球范围内的不可撤销的、无限期的、可转让的非独家使用权，许可[小鸟壁纸]对前述内容进行任何形式的复制、修改、出版、发行及以其他方式使用或者授权第三方进行复制、修改、出版、发行及以其他方式使用。

                        [小鸟壁纸]有权将用户上传的壁纸以付费下载的形式对外提供，所得收益将由本平台和上传用户分成；对外付费下载的价格由本平台设定，并且本平台有权对定价进行调整，用户对此不持异议。

                        因用户进行上述内容在本网站的上载或发布，而导致任何第三方提出索赔要求或衍生的任何损害或损失，由用户承担全部责任。

                        如因用户上传至本平台的作品被第三方声称侵犯其任何权利的，本平台有权随时将相关作品删除而无经过上传用户的同意；同时，本平台有权追回该用户因上传该等作品而取得的任何收益，包括但不限于收费分成、虚拟币等。

                        内容权利详情请见：“上传须知”及“版权保护指引”。

                        四、隐私保护
                        保护用户隐私是[小鸟壁纸 ]的重点原则，[小鸟壁纸 ]保证不对外公开或向第三方提供用户注册资料及用户在使用服务时存储在[小鸟壁纸 ]的非公开内容，但下列情况除外：

                        1、事先获得用户的明确授权；

                        2、根据有关的法律法规要求；

                        3、按照相关政府主管部门及司法机关的要求；

                        4、为维护用户及社会公众的利益；

                        5、为维护[大鸟壁纸]的合法权益。

                        [小鸟壁纸 ]可能会与第三方合作向用户提供相关的服务，在此情况下，如该第三方同意承担与[小鸟壁纸 ]同等的保护用户隐私的责任，则[小鸟壁纸 ]可将用户的注册资料等提供给该第三方。 在不透露单个用户隐私资料的前提下，[小鸟壁纸 ]有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。

                        五、 免责声明
                        1、我们对于任何自本网站而获得的他人的信息、内容或者广告宣传等任何资讯（以下统称“信息”），不保证真实、准确和完整性。如果任何单位或者个人通过上述“信息”而进行任何行为，须自行甄别真伪和谨慎预防风险，否则，无论何种原因，我们不对任何非与我们直接发生的交易和/或行为承担任何直接、间接、附带或衍生的损失和责任。

                        2、我们不保证（包括但不限于）：

                        (a) 我们网站及内容适合您的使用要求；

                        (b) 我们网站及内容不受干扰，及时、安全、可靠或不出现错误；

                        (c) 您经由我们网站取得的任何产品、服务或其他材料符合您的期望。

                        3、您使用经由我们网站下载或取得的任何资料，其风险由您自行承担；因该等使用导致您电脑系统损坏或资料流失，您应自己负完全责任；

                        4、基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，我们不承担任何直接、间接的赔偿：

                        (a) 对我们网站及内容的使用或无法使用；

                        (b) 用户资料遭到未授权的使用或修改；

                        (c) 其他与我们相关的事宜。

                        六、修改协议
                        [小鸟壁纸 ]有权随时修改本协议的有关条款，一旦条款内容发生变动，[小鸟壁纸 ]将会在相关的页面提示修改内容。 用户如果不同意[小鸟壁纸 ]对服务条款所做的修改，可以放弃使用或访问本网站或取消已经获得的服务。如果用户继续使用服务，则视为用户接受服务条款的变动。

                        七、本协议解释权归[小鸟壁纸 ]所有。
                    </p>
                </div>
            </div>
            <span slot="footer" class="dialog-footer">
              <span class="time_btn" v-if="timer>0">{{timer}}s</span>
              <el-button class="agreed" v-if="timer<=0" type="primary" @click="handleAgreed">我同意</el-button>
            </span>
        </el-dialog>

    </div>

</template>

<script>
    export default {
        name: "protocol",
        data(){
            return {
                readProtocol:false,
                timer:3,
                isAgree:false,

                dialogVisible: true,
            }
        },
        methods:{
            handleAgreed(){
                this.isAgree=true;
                this.readProtocol=false;
                this.$emit('agreementAgree', this.isAgree);

                this.dialogVisible = false;
            },
            handleTimer(){
                let timers=setInterval(()=>{
                    this.timer--;
                    if(this.timer===0){
                        clearInterval(timers);
                    }
                },1000);
            }
        },
        mounted(){

        }
    }
</script>

<style scoped lang="less">
    .protocol_mask{
        display: flex;
        justify-content: center;
        align-items: center;
        .el-dialog__wrapper{
            .el-dialog{
                margin: 0 !important;
                .protocol_body{
                    .el-dialog__body{
                        padding-top: 10px;
                        padding-bottom: 10px;
                    }
                    .protocol_details{
                        height:445px;
                        margin:0 auto;
                        padding:18px 0 18px 20px;
                        background:#eee;
                        border:1px solid #ccc;
                        border-radius:3px;
                    }
                    .protocol_txt{
                        height:411px;
                        font-size: 14px;
                        font-weight: normal;
                        font-stretch: normal;
                        line-height: 22px;
                        letter-spacing:0;
                        color: #222222;
                        overflow:auto;
                        padding-right: 10px;
                        margin-right: 10px;
                    }
                    .time_btn{
                        display:block;
                        width:140px;
                        height:35px;
                        color:#fff;
                        cursor:not-allowed;
                        margin:16px auto 0;
                        line-height:35px;
                        font-size:14px;
                        text-align:center;
                        background:#ccc;
                        border-radius:3px;
                    }
                    .agreed{
                        display:block;
                        width:140px;
                        height:35px;
                        margin:16px auto 0;
                        background-color:#15bafe;
                        border-color:#15bafe;
                    }
                    .agreed:active{
                        background:#409EFF;
                    }
                }
            }
        }
    }
</style>
